# Data wrangling

Data wrangling is a broad term used, often informally, to describe the process of
transforming raw data to a clean and organized format ready for use. For us, data
wrangling is only one step in preprocessing our data, but it is an important step.

The most common data structure used to “wrangle” data is the data frame, which can
be both intuitive and incredibly versatile. Data frames are tabular, meaning that they
are based on rows and columns like you would see in a spreadsheet

**[To Know More About Markdown Latext](https://csrgxtu.github.io/2015/03/20/Writing-Mathematic-Fomulars-in-Markdown/)**

In [139]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn
import scipy

# Load CSV File

In [140]:
# Read CSV files by making one column as index
# data_frame = pd.read_csv('dataset/circle_employee.csv', index_col='name') 

df = pd.read_csv('dataset/circle_employee.csv')
df.head()

,id,name,age,blood_group,gender,experience,designation,salary
0,1,Sharif,NaN,B+,male,1.5,Jr Software Engineer,30000
1,2,Kanan Mahmud,28.0,NaN,Male,7.5,Sr Software Engineer,80000
2,3,Md. Shakil,27.0,B-,Male,3.5,Software Engineer,45000
3,4,Imran Sheikh,25.0,B-,Male,1.8,Jr Software Engineer,30000
4,5,Farsan Rashid,27.0,O+,Male,4.2,Software Engineer,55000

# Create Dataframe

### Using List

In [131]:
dataframe = pd.DataFrame()

dataframe['Name'] = ['Sharif','Imran','Hanif','Akib','Fatin','Irfan', 'Akash', 'Mahrez']
dataframe['Age'] = [26,24,np.nan,23,25,29,36,22]
dataframe['Blood Group'] = ['B+','O+','AB+','A+','O-','AB+', 'AB+', 'O+']
dataframe['Sex Code'] = [1,1,1,1,1,1,1,1]

dataframe

     Name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1
1   Imran  24.0          O+         1
2   Hanif   NaN         AB+         1
3    Akib  23.0          A+         1
4   Fatin  25.0          O-         1
5   Irfan  29.0         AB+         1
6   Akash  36.0         AB+         1
7  Mahrez  22.0          O+         1

### Using Dictionary

In [142]:
dct = {
    "name":['Sharif','Imran','Hanif','Akib','Fatin','Irfan', 'Akash', 'Mahrez'],
    "Age":[26,24,np.nan,23,25,29,36,22],
    "Blood Group": ['B+','O+','AB+','A+','O-','AB+', 'AB+', 'O+'],
    "Sex Code": [1,1,1,1,1,1,1,1]
}
df = pd.DataFrame(dct)
df

     name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1
1   Imran  24.0          O+         1
2   Hanif   NaN         AB+         1
3    Akib  23.0          A+         1
4   Fatin  25.0          O-         1
5   Irfan  29.0         AB+         1
6   Akash  36.0         AB+         1
7  Mahrez  22.0          O+         1

# append new rows to the bottom by SERIES

In [143]:
new_person = pd.Series(['Kanan Mahmud',30,'B+',1],
                       index=['Name','Age','Blood Group','Sex Code'])

dataframe.append(new_person, ignore_index=True)

           Name   Age Blood Group  Sex Code
0        Sharif  26.0          B+         1
1         Imran  24.0          O+         1
2         Hanif   NaN         AB+         1
3          Akib  23.0          A+         1
4         Fatin  25.0          O-         1
5         Irfan  29.0         AB+         1
6         Akash  36.0         AB+         1
7        Mahrez  22.0          O+         1
8  Kanan Mahmud  30.0          B+         1

# Describe Dataset

In [144]:
# Show dimensions
dataframe.shape

(8, 4)

In [145]:
# Show statistics
dataframe.describe()

             Age  Sex Code
count   7.000000       8.0
mean   26.428571       1.0
std     4.790864       0.0
min    22.000000       1.0
25%    23.500000       1.0
50%    25.000000       1.0
75%    27.500000       1.0
max    36.000000       1.0

## Calculate Standard Daviation

$SD=\sqrt{\sum_{i=0}^N\frac{(x-\Phi)^2}{N}}$

- $\Phi$ is the mean
- N is Total Number of data
- SD Standard Daviation

# Select one or more rows or values

In [146]:
# Select first row
print(dataframe.iloc[0])

# Select three rows
dataframe.iloc[1:4]

# Select three rows
dataframe.iloc[:4]

Name           Sharif
Age                26
Blood Group        B+
Sex Code            1
Name: 0, dtype: object

     Name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1
1   Imran  24.0          O+         1
2   Hanif   NaN         AB+         1
3    Akib  23.0          A+         1

# Set Index For Data Frame
All rows in a pandas DataFrame have a unique index value. By default, this index is
an integer indicating the row position in the DataFrame; however, it does not have to
be. DataFrame indexes can be set to be unique alphanumeric strings or customer
numbers. To select individual rows and slices of rows, pandas provides two methods:
* **loc** is useful when the index of the DataFrame is a label (e.g., a string).
* **iloc** works by looking for the position in the DataFrame. For example, iloc[0] will return the first row regardless of whether the index is an integer or a label.

It is useful to be comfortable with both loc and iloc since they will come up a lot
during data cleaning.

Although DataFrames provide built in numerical index But We can set the index of a DataFrame to any value where the value is unique to each row.

In [147]:
# Set index
df = dataframe.set_index(dataframe['Name'])
print(dataframe)

# Show row
df.loc['Sharif']

     Name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1
1   Imran  24.0          O+         1
2   Hanif   NaN         AB+         1
3    Akib  23.0          A+         1
4   Fatin  25.0          O-         1
5   Irfan  29.0         AB+         1
6   Akash  36.0         AB+         1
7  Mahrez  22.0          O+         1

Name           Sharif
Age                26
Blood Group        B+
Sex Code            1
Name: Sharif, dtype: object

# Selecting Rows Based on Conditionals
Conditionally selecting and filtering data is one of the most common tasks in data wrangling. You rarely want all the raw data from the source; instead, you are interested in only some subsection of it. For example, you might only be interested in stores
in certain states or the records of patients over a certain age.

In [148]:
# Show top two rows where column 'Blood Group' is 'B+'
print(dataframe[dataframe['Blood Group'] == 'B+'])

# multiple condition
dataframe[(dataframe['Sex Code'] == 1) & (dataframe['Age'] >= 24)]

     Name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1

     Name   Age Blood Group  Sex Code
0  Sharif  26.0          B+         1
1   Imran  24.0          O+         1
4   Fatin  25.0          O-         1
5   Irfan  29.0         AB+         1
6   Akash  36.0         AB+         1

# Replacing Values|
replace is a tool we use to replace values that is simple and yet has the powerful ability to accept regular expressions.pandas **replace** is an easy way to find and replace values.

In [149]:
# Replace values, show two rows
print(dataframe['Sex Code'].replace(1, "Man").head(2))

0    Man
1    Man
Name: Sex Code, dtype: object

We can also replace multiple values at the same time:

In [ ]:
# Replace "female" and "male with "Woman" and "Man"
dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5)

We can also find and replace across the entire DataFrame object by specifying the whole data frame instead of a single column:

In [150]:
# Replace values, show two rows
dataframe.replace(1, "One")

     Name   Age Blood Group Sex Code
0  Sharif  26.0          B+      One
1   Imran  24.0          O+      One
2   Hanif   NaN         AB+      One
3    Akib  23.0          A+      One
4   Fatin  25.0          O-      One
5   Irfan  29.0         AB+      One
6   Akash  36.0         AB+      One
7  Mahrez  22.0          O+      One

# Rename Column
Using rename with a dictionary as an argument to the columns parameter is my preferred way to rename columns because it works with any number of columns. If we want to rename all columns at once, this helpful snippet of code creates a dictionary with the old column names as keys and empty strings as values

In [151]:
dataframe.rename(columns={'Sex Code': 'Sex'})

     Name   Age Blood Group  Sex
0  Sharif  26.0          B+    1
1   Imran  24.0          O+    1
2   Hanif   NaN         AB+    1
3    Akib  23.0          A+    1
4   Fatin  25.0          O-    1
5   Irfan  29.0         AB+    1
6   Akash  36.0         AB+    1
7  Mahrez  22.0          O+    1

# Finding the Minimum, Maximum, Sum, Average, and Count

In [152]:
# Calculate statistics
print('Maximum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

Maximum: 36.0
Minimum: 22.0
Mean: 26.428571428571427
Sum: 185.0
Count: 7

In addition to the statistics used in the solution, pandas offers **variance ( var ), stan‐
dard deviation ( std ), kurtosis ( kurt ), skewness ( skew ), standard error of the mean
( sem ), mode ( mode ), median ( median ),** and a number of others.
Furthermore, we can also apply these methods to the whole DataFrame:

In [153]:
# Show counts
dataframe.count()

Name           8
Age            7
Blood Group    8
Sex Code       8
dtype: int64

# Finding Unique Values

In [158]:
# Select unique values
print(dataframe['Blood Group'].unique())

#Alternatively, value_counts will display all unique values with the number of times each value appears:
# Show counts
dataframe['Blood Group'].value_counts()

['B+' 'O+' 'AB+' 'A+' 'O-']

AB+    3
O+     2
A+     1
O-     1
B+     1
Name: Blood Group, dtype: int64